Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/pre_school_education_and_childcare/community_employment_childcare_programme.html.txt.tmx
Source language: en
Languages: ga

source: Community Employment Childcare Programme
ga: An Clár Fostaíocht Pobail um Chúram Leanaí

source: The Community Employment Childcare (CEC) Programme provides childcare places for Community Employment (CE) applicants who need childcare so that they can take up a place on a CE scheme
ga: Soláthraíonn an Clár Fostaíocht Pobail um Chúram Leanaí (CEC) áiteanna i gcúram leanaí d’iarratasóirí ar an gclár fostaíocht pobail (CE) a dteastaíonn cúram leanaí uathu ionas gur féidir leo glacadh le háit ar scéim fostaíocht pobail

source: Both existing CE participants and new entrants can apply for the CEC Programme
ga: Is féidir le rannpháirtithe CE agus iontrálaithe nua iarratas a dhéanamh ar an CEC

source: Part-time childcare places will be available for children up to 5 years of age and after-school childcare places will be provided to children up to 13 years of age
ga: Beidh áiteanna páirtaimseartha cúram leanaí ar fáil do leanaí suas go dtí 5 bliana d’aois agus cuirfear áiteanna cúram iarscoile leanaí ar fáil do leanaí suas go dtí 13 bliana d’aois

source: The number of places available under the CEC Programme is limited
ga: Tá teorainn leis an líon áiteanna atá ar fáil faoin gClár Fostaíocht Pobail um Chúram Leanaí

source: Places are allocated on a first-come first-served basis
ga: Leithdháiltear áiteanna ar bhonn tús freastail ar an gceann is túisce

source: You may qualify for a childcare place while on CE if:
ga: Féadfaidh tú cáiliú le haghaidh áit chúram leanaí más rud é:

source: • You have been offered a place on a CE scheme
ga: • Gur tairgeadh áit i scéim CE duit

source: • You are the main carer of a child or children
ga: • Gur tusa an príomhchúramóir linbh nó leanaí

source: • You need assistance with child care in order to take up a place on a CE scheme
ga: • Go dteastaíonn cabhair uait le cúram leanaí chun glacadh le háit i scéim CE

source: Places will be provided for 50 weeks in a 12-month period
ga: Cuirfear áiteanna ar fáil 50 seachtain i dtréimhse 12 mhí

source: If you are absent from CE for a prolonged period you will not be able to avail of child care through the CEC Programme
ga: Má tá tú as láthair ó CE ar feadh tréimhse fhada, ní bheidh tú in ann leas a bhaint as cúram leanaí tríd an gClár CEC

source: Early Childhood Care and Education Scheme
ga: An Scéim um Chúram agus Oideachas na Luath-Óige

source: If your child is participating in Early Childhood Care and Education (ECCE) Scheme at the same time as you are on CE (either morning or afternoon), that child cannot transfer to a childcare place on the CEC Programme
ga: Más rud é go bhfuil do leanbh ag glacadh páirt i Scéim um Chúram agus Oideachas na Luath-Óige (ECCE) an tráth céanna is atá tú i scéim CE (ar maidin nó tráthnóna), ní fhéadfaidh an leanbh sin aistriú chuig áit chúram leanaí ar an gClár CEC

source: However, if a you are attending CE on an alternative time of day to the child's ECCE programme you can also avail of a childcare place on the CEC Programme while you are on CE
ga: Mar sin féin, má tá tú ag freastal ar scéim CE ag am sa lá atá difriúil leis an am sa lá a bhfuil clár ECCE do linbh ar siúl, féadfaidh tú leas a bhaint as áit chúram leanaí sa Chlár CEC agus tú i scéim CE

source: The maximum amount per child that childcare providers may charge to parents per week is:
ga: Is é an t-uasmhéid sa leanbh a fhéadfaidh soláthraithe cúram leanaí a ghearradh ar thuismitheoirí sa tseachtain ná:

source: • Part time: €15 per week
ga: • Páirtaimseartha: €15 sa tseachtain

source: • Afterschool: €15 per week
ga: • Tar éis na scoile: €15 sa tseachtain

source: The CE sponsor will tell you about the CEC Programme and give you a list of childcare providers participating in the programme
ga: Inseoidh d’urraitheoir CE duit faoin gClár CEC agus tabharfaidh sé liosta de na soláthraithe cúram leanaí atá ag glacadh páirt sa chlár duit

source: You should then contact a childcare provider in your area to book a childcare place under the CEC Programme
ga: Ba cheart duit teagmháil a dhéanamh ansin le soláthraí cúram leanaí i do cheantar chun áit chúram leanaí a chur in áirithe faoin gClár CEC

source: You can use your letter of offer of a CE place to do this
ga: Is féidir leat do litir thairisceana d’áit CE a úsáid chun déanamh amhlaidh

source: If you are already on CE, your sponsor will give you a letter stating this
ga: Má tá tú sa scéim CE cheana féin, tabharfaidh d’urraitheoir litir duit lena sonraítear a leithéid

source: The childcare provider will accept your letter and offer you a place, if there are places available
ga: Glacfaidh an soláthraí cúram leanaí le do litir agus tairgfidh sé áit duit má tá áiteanna ar fáil

source: If you cannot find a place for your child you should contact your local City or County Childcare Committee and let them know the area in which you need a childcare place
ga: Mura féidir leat áit a fháil do do leanbh ba cheart duit dul i dteagmháil leis an gCoiste Contae agus Cathrach i gCúram Leanaí atá áitiúil duit agus cur in iúl dóibh cé acu ceantar ina dteastaíonn áit chúram leanaí uait
